&НаСервереБезКонтекста
Функция ОчиститьДвиженияДокументаНаСервере(Документ)
	
	Возврат СерверныеПроцедуры.ОчиститьДвиженияДокументаНаСервере(Документ);
	
КонецФункции

&НаКлиенте
Процедура ОчиститьДвиженияДокумента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстРезультата = ОчиститьДвиженияДокументаНаСервере(Документ);
	
	Если НЕ ЗначениеЗаполнено(ТекстРезультата) Тогда
		
		ТекстРезультата = "Движение успешно очищено";
		
	КонецЕсли;
	
	Сообщить(ТекстРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура СверткаФоновая(Команда)
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СверткаФоноваяНаСервере(Документ);
	
	ПодключитьОбработчикОжидания("ОбработатьРезультатСвертки", 5);
	
КонецПроцедуры // СверткаФоновая()

&НаСервере
Функция СверткаФоноваяНаСервере(Документ)
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Документ);
	
	ФЗ = ФоновыеЗадания.Выполнить("СерверныеПроцедуры.ОчиститьДвиженияДокументаНаСервере", МассивПараметров);
	УИФЗ = ФЗ.УникальныйИдентификатор;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатСвертки()
	
	ТекстРезультата = ОбработатьРезультатСверткиНаСервере(УИФЗ);
	
	Если ЗначениеЗаполнено(ТекстРезультата) Тогда
		
		Сообщить(ТекстРезультата);
		ОтключитьОбработчикОжидания("ОбработатьРезультатСвертки");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработатьРезультатСверткиНаСервере(УИФз)
	
	ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УИФЗ);
	
	Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		Возврат "Движение успешно очищено";
		
	ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		
		Возврат ФЗ.ИнформацияОбОшибке.Описание;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

