
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивТиповДинамическогоСписка = Новый Массив;
	МассивТиповДинамическогоСписка.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДинамическогоСписка = Новый ОписаниеТипов(МассивТиповДинамическогоСписка);

	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РеквизитСписокНоменклатура", 
																ОписаниеТиповДинамическогоСписка,																,
																"Список номенклатура",
																Ложь));
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	РеквизитФормыСписокНоменклатура = ЭтотОбъект["РеквизитСписокНоменклатура"];
	РеквизитФормыСписокНоменклатура.ТекстЗапроса =  "ВЫБРАТЬ
													|	Номенклатура.Наименование КАК Наименование,
													|	Номенклатура.Код КАК Код
													|ИЗ
													|	Справочник.Номенклатура КАК Номенклатура";
	РеквизитФормыСписокНоменклатура.ОсновнаяТаблица = "Справочник.Номенклатура";

	ЭлементДинамическийСписок = Элементы.Добавить("ЭлементСписокНоменклатура", Тип("ТаблицаФормы"));
	ЭлементДинамическийСписок.ПутьКДанным = "РеквизитСписокНоменклатура";

	НоваяКолонкаТаблицы = Элементы.Добавить("КолонкаНаименование", Тип("ПолеФормы"), ЭлементДинамическийСписок);
	НоваяКолонкаТаблицы.ПутьКДанным = "РеквизитСписокНоменклатура.Наименование";
	НоваяКолонкаТаблицы = Элементы.Добавить("КолонкаКод", Тип("ПолеФормы"), ЭлементДинамическийСписок);
	НоваяКолонкаТаблицы.ПутьКДанным = "РеквизитСписокНоменклатура.Код";
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОстатки(Команда)
	ПоказатьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьОстаткиНаСервере()
	СуществующийДС = ЭтотОбъект["РеквизитСписокНоменклатура"];
	СуществующийДС.ТекстЗапроса = "ВЫБРАТЬ
	|	СравочникНоменклатура.Наименование как Наименование,
	|	СравочникНоменклатура.Код как Код,
	|	ОстаткиТоваров.КоличествоТоваров как КоличествоТоваров
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров КАК ОстаткиТоваров
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СравочникНоменклатура
	|		ПО ОстаткиТоваров.Номенклатура = СравочникНоменклатура.Ссылка";
	СуществующийЭлементДС = Элементы["ЭлементСписокНоменклатура"];

	НоваяКолонкаТаблицы = Элементы.Добавить("КолонкаКоличествоТоваров", Тип("ПолеФормы"), СуществующийЭлементДС);
	НоваяКолонкаТаблицы.ПутьКДанным = "РеквизитСписокНоменклатура.КоличествоТоваров";
КонецПроцедуры

