
Процедура ПередЗаписью(Отказ)
	Если УникальныйИдентификатор="" Тогда
		П = ПользователиИнформационнойБазы.СоздатьПользователя();
		П.Имя = Наименование;
		Если ПараметрыСеанса.ТекущийПользователь=Справочники.Пользователи.ПустаяСсылка() Тогда
			П.Роли.Добавить(Метаданные.Роли.Администратор);
		Иначе
			П.Роли.Добавить(Метаданные.Роли.Пользователь);
		КонецЕсли;
		П.АутентификацияСтандартная = Истина;
		П.Записать();
		УникальныйИдентификатор = П.УникальныйИдентификатор;
	КонецЕсли
КонецПроцедуры
