
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если УникальныйИдентификатор="" Тогда
		П = ПользователиИнформационнойБазы.СоздатьПользователя();
		П.Имя = Наименование;
		Если ПараметрыСеанса.ТекущийПользователь=Справочники.Пользователи.ПустаяСсылка() Тогда
			П.Роли.Добавить(Метаданные.Роли.Администратор);
		Иначе
			П.Роли.Добавить(Метаданные.Роли.Пользователь);
		КонецЕсли;
		П.АутентификацияСтандартная = Истина;
		П.Записать();
		УникальныйИдентификатор = П.УникальныйИдентификатор;
	КонецЕсли
КонецПроцедуры



Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Польз = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
    Польз.Удалить();
КонецПроцедуры
