Функция ЦеныИзРегистраСведений(ДатаНоменклатуры, НоменклатураИзРегистра, Договор) Экспорт    Отбор = Новый Структура("Номенклатура, Договор", НоменклатураИзРегистра, Договор);    ЗначениеЦены = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаНоменклатуры, Отбор);    Возврат ЗначениеЦены.Цена;КонецФункции

Функция ОчиститьДвиженияДокументаНаСервере(Документ) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого МетаданныеРН Из Документ.Метаданные().Движения Цикл
		
		Набор = РегистрыНакопления[МетаданныеРН.Имя].СоздатьНаборЗаписей();
		
		Набор.Отбор.Найти("Регистратор").Установить(Документ);
		
		Попытка
			
			Набор.Записать();
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			
			ОтменитьТранзакцию();
			
			Возврат ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат "";
	
КонецФункции